---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Entity..::..Clear Method
Entity Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Clear(String) | Resets the field to its default value. |
|  | Clear(Field) | Resets the field to its default value. |

# See Also

Entity Class

Entity Members

Autodesk.Revit.DB.ExtensibleStorage Namespace